[{"praana":{"title":{"dimensions":{"width":350,"height":32},"alt":null,"copyright":null,"url":"https://prismic-io.s3.amazonaws.com/amanda-blog/947a3677-49b0-484c-a7de-d5f82e1eb1f4_praana.svg"},"image":{"dimensions":{"width":563,"height":349},"alt":null,"copyright":null,"url":"https://images.prismic.io/amanda-blog/db74b771-36b7-465e-8d88-036f1feabbd3_IMG_2674.jpg?auto=compress,format"},"content":[{"type":"paragraph","text":"Praana Wellness is a restored distillery, built in 1881 and majestically nestled amongst the Cognac vines of the Charente Maritime. Our luxury retreat centre offers a variety of options depending on your needs. It could be the place you are looking for to host a retreat or workshop for your guests or colleagues (catered and self-catered options available). Or, maybe you are organising a family holiday or special event and you would like us to help you organise it. Our luxury bed and breakfast options are very popular for those passing through the region (we are particularly popular with cycling groups and wedding parties).","spans":[]},{"type":"paragraph","text":"We offer a variety of yoga classes suitable for all abilities at the centre and there is a masseuse during the season who offers a range of treatments to all our guests. Praana Wellness also offers several retreats through the season for those looking for a little more for themselves and Amanda also hosts private therapeutic retreats throughout the year at Praana Wellness for individuals, families or couples. These retreats are individual programmes written specifically for individuals needs and you can get more information on this at https://praanawellness.com/","spans":[{"start":541,"end":568,"type":"hyperlink","data":{"link_type":"Web","url":"https://praanawellness.com/"}}]},{"type":"paragraph","text":"Your wellbeing is our business (as is your privacy) and we want you to feel at home, to experience the wonderfully peaceful energy here at Praana Wellness . We have made it our goal to create a comfortable space that reflects the owners travels and cross-cultural experiences. Amanda & Fraser have been living and working in Africa, Asia and the Middle East since the 1980's. They currently work and travel between November and February each year to satisfy their wanderlust and continue learning although Amanda makes exceptions for private therapeutic retreats. It was indeed Amanda's dream to create a non-clinical wellness centre in Europe, somewhere that everyone could find what they needed (if only rest and respite from their busy lives).","spans":[]}]}}]