[{"intro":{"title":[{"type":"heading1","text":"Meet Amanda Graham","spans":[]}],"image":{"dimensions":{"width":960,"height":960},"alt":null,"copyright":null,"url":"https://images.prismic.io/amanda-blog/bc62e1f2-1c84-4b29-83d8-bccdcf399a15_amanda.jpg?auto=compress,format"},"image_link":{"link_type":"Media","name":"amanda.jpg","kind":"image","url":"https://images.prismic.io/amanda-blog/bc62e1f2-1c84-4b29-83d8-bccdcf399a15_amanda.jpg?auto=compress,format","size":"163608","height":"960","width":"960"},"intro":[{"type":"paragraph","text":"Seeking therapy - especially for the first time - can feel scary and vulnerable.  Amanda has adapted all of the therapeutic work she does so it is deliverable online now.  Currently, due to the global circumstances, Amanda is able to continue delivering therapy to her clients from Praana Wellness in South West France via the internet.  All that is required is a video link and all meetings are undertaken via a confidential meeting room.  Taking that first step to contact Amanda is not only the most difficult part of starting therapy but it is also one of the best things you can do for yourself, your overall well-being and, those who love you. ","spans":[]},{"type":"paragraph","text":"I’m Amanda Graham, an adult and adolescent counselling psychologist – and one of few insight-oriented psychodynamically-trained relational therapists around. ","spans":[]},{"type":"paragraph","text":"This means that I am fully versed in – and qualified to use – evidence-based therapies (which are researched and proven) but typically take a more nuanced and personal psychodynamic approach to understand and support my clients. I offer a holistic approach to healing where appropriate.","spans":[]}],"about":[{"type":"heading2","text":"About","spans":[]},{"type":"paragraph","text":"Amanda is a Counselling Psychologist with an MSc in Mental Health Psychology from the Russell Group University of Liverpool.  She also holds post graduate diplomas in Counselling, Cognitive Behavioural Therapy, Clinical Hypnotherapy and is an Ayurvedic Lifestyle Coach as well as a Yoga Therapist.  She is currently doing a year long training programme in the modality of Compassionate Inquiry with Dr Gabor Maté.  We, as therapists, help the client to recognise the unconscious dynamics that run their lives and how to liberate themselves from them.  ","spans":[]},{"type":"paragraph","text":"She has been counselling since the 1980's and began her career working with 16-24 year olds. A running theme throughout her career is her work with adolescents both as an adviser to an international school, support to families in expat environments and the challenges faced by culturally integrated families.","spans":[]},{"type":"paragraph","text":"As an adoptee she has first hand experience of the emotional needs of both adopted parents and adopted children and advises both on moving through the search process for a birth parent, the introduction, settling in and acceptance process.  ","spans":[]},{"type":"paragraph","text":"Her experience of counselling people coping with addiction also spans almost 3 decades and her continuous research into the causes of addiction help her to introduce more holistic methods of treatment in the non-clinical environment that she has created at her therapeutic wellness centre, Praana Wellness, in South West France. ","spans":[{"start":290,"end":305,"type":"hyperlink","data":{"link_type":"Web","url":"https://praanawellness.com"}}]},{"type":"paragraph","text":"Intensive couples therapy is also a popular programme at Praana Wellness.  Whether only just aware of issues creeping in to a relationship or feeling as though this is 'the last chance' Amanda will deliver a programme over a long weekend (or now online)  designed to help couples re-connect and look at their issues from a different perspective.  Homework is key and often continuation in therapy is needed via online video link for the immediate future following the weekend.","spans":[]},{"type":"paragraph","text":"Amanda continues to work amongst expat communities of Africa, Asia, the Middle East and Europe, with adolescents and adults. Helping adolescents cope with the increasing pressures of our fast paced lives and helping them recognise and manage the onset of symptoms before they become entrenched in their adult life is of the upmost importance to her. She continues to research the causes of addiction and chronic illness and will be undertaking further intensive training into trauma in childhood and it's link to addiction over the coming year.  ","spans":[]},{"type":"paragraph","text":"Amanda's approach to counselling is fairly unique. One of the reasons she moved away from working in the social services environment in the UK is because she believed the system was too linear in its approach to helping people with mental health issues and she became increasingly stifled by the working restrictions when helping people so disconnected. Despite not having done her more holistic trainings at the time she knew there was more that could be offered to give these people hope and relief. ","spans":[]},{"type":"paragraph","text":"You will not experience what she refers to as a 'typical psychotherapeutic approach'. While she is grateful for all of the academic training and work experience she has accumulated in the past 3 decades and will always be grounded in evidence-based practise, she has also, in the past 15 years, developed a more holistic and directive approach to her clinical practise. She will equip you with the necessary tools to manage whatever it is you are challenged by. Homework is key, a willingness to make change is paramount, her support is continual when you are in therapy and beyond.","spans":[]},{"type":"paragraph","text":"For details of Amanda's programmes and to book an appointment please go to the information page on this website or email amanda@praanawellness.com. A brief telephone call is usually in order to establish the best route for you.","spans":[{"start":78,"end":91,"type":"hyperlink","data":{"link_type":"Web","url":"https://amandagrahampsychology.com/contact"}},{"start":121,"end":146,"type":"hyperlink","data":{"link_type":"Web","url":"mailto:amanda@praanawellness.com"}}]}]}}]