[{"post":{"title":[{"type":"heading1","text":"What makes us Happy?","spans":[]}],"sub_title":[{"type":"heading3","text":"Should we be happy all of the time?.","spans":[]}],"date":"2020-01-17","image":{"dimensions":{"width":960,"height":720},"alt":null,"copyright":null,"url":"https://images.prismic.io/amanda-blog/e99051b1-c1c3-499f-8e99-b74b5d629610_IMG_4546.JPG?auto=compress,format"},"content":[{"type":"paragraph","text":"What makes us happy? Do we truly know?","spans":[]},{"type":"paragraph","text":"Let me start by saying that we can’t be happy all the time. Nope, it’s just not possible. However, if we consciously invite happiness into our lives then it makes dealing with the challenges much easier. Dr Rick Hanson refers to it as the ‘law of little things’. In the same way that when we think negatively it seems that the challenges pile up and we feel swamped just adding to the negative feelings. But, if we introduce happiness to our daily lives, for example, in the form of sitting or walking meditations, simply thinking of someone who really cares for us or resisting posting those negative comments (no matter how angry or frustrated we may be with a situation), then by the same method those little positive bursts of happiness will add up. This results in the creation of a bank of goodness in our subconscious mind and hey presto life actually becomes brighter and happier!","spans":[{"start":262,"end":263,"type":"strong"}]},{"type":"paragraph","text":"I have moved house in the past week. Not far, actually maybe 200 metres but it may as well be 50km for the difference it has made to my internal happiness. I am still at the same address, Praana Wellness @ Chez Vallee but, having slept in every room in the big house as we renovated it over an almost 6 year period, I decided that what I was craving now, more than anything, was a smaller cosier home. A home where I could have all of my personal belongings around me. A home where I could shut the door and find my very own privacy when necessary. A home that is simple, small and has as few electrical items as possible!","spans":[{"start":315,"end":316,"type":"strong"},{"start":401,"end":402,"type":"strong"}]},{"type":"paragraph","text":"At different times of life we crave different things. As I reflect I realise they do coincide with the decades of age and so, while for almost 20 years I was really happy with being fairly nomadic, travelling the world, experiencing different cultures, now, as I traverse my fifties, I realise this is the simple happiness I have been craving.","spans":[]},{"type":"paragraph","text":"So, I have asked myself why, over the week I have been living in Lavender Cottage, has it had such an impact and I think I can answer that question now. It is so important to have time for reflection. When I was living in Chez Vallée my business and my personal space and life merged into one. When I wasn’t seeing clients, teaching yoga or marketing the business I was still available for work at any hour. I would respond to emails whatever the hour. Since moving to the cottage I have made a pact not to work here, to have defined hours around my client calls and I now ‘go to the office’ and more importantly leave the office! My commute isn’t long in terms of distance, but it is huge in terms of effect. How can I be so close to my work space and yet feel so far away? Well it’s all down to personal choice, to making small changes and to discipline. Perhaps it is these three points that ultimately put us in control of our own personal happiness. Nothing else. When we make decisions that ultimately put us in control of our destiny then we create a happiness within that cannot be matched from a longevity perspective. Renovating Lavender cottage took four months and a tremendous amount of energy that I thought was impossible to find. But the happiness and peace created helps you soon forget the difficulties you have overcome to reach this point. The mind is great at enabling us to achieve this IF we allow it.","spans":[]},{"type":"paragraph","text":"There is a Buddhist saying: “Do not think lightly of good [meaning that happiness/good/positivity will not just come to you]. Drop by drop is the water pot filled. Likewise the wise one gathering little by little fills oneself with good”.","spans":[{"start":27,"end":238,"type":"em"}]},{"type":"paragraph","text":"Perhaps ask yourself are you choosing to fill your pot of happiness little by little?","spans":[]}]},"formattedDate":"January 17, 2020"}]